agency-services-transunion/lib/examples/brave/StartDispute.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:con="https://consumerconnectws.tui.transunion.com/"
  xmlns:data="https://consumerconnectws.tui.transunion.com/data"
  xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
  <soapenv:Header/>
  <soapenv:Body>
    <con:StartDispute>
      <con:request>
        <data:AccountCode></data:AccountCode>
        <data:AccountName></data:AccountName>
        <data:RequestKey>BC-c61c0eda-ea34-462d-8870-4005d2d427af</data:RequestKey>
        <data:ClientKey>fc02d26c-516e-453a-b18b-729000d1be39</data:ClientKey>
        <data:Customer>
          <data:CurrentAddress>
            <data:AddressLine1>105 2ND AV</data:AddressLine1>
            <data:AddressLine2 xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:City>NEWTON</data:City>
            <data:State>IA</data:State>
            <data:Zipcode>50208</data:Zipcode>
          </data:CurrentAddress>
          <data:DateOfBirth>1971-02-01</data:DateOfBirth>
          <data:FullName>
            <data:FirstName>DANIEL</data:FirstName>
            <data:LastName>ILES</data:LastName>
            <data:MiddleName>J</data:MiddleName>
            <data:Prefix xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:Suffix xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
          </data:FullName>
          <data:PhoneNumber xsi:nil="true"
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
          <data:Ssn>666130041</data:Ssn>
          <data:Identifier>
            <data:CustomerIdentifier>
              <data:Id>666130041</data:Id>
              <data:IdentifierType>SocialId</data:IdentifierType>
            </data:CustomerIdentifier>
          </data:Identifier>
        </data:Customer>
        <data:EnrollmentKey>db73073c-86ac-46ab-a31c-47855d237e28</data:EnrollmentKey>
        <data:LineItems>
          <data:LineItem>
            <data:ClaimCodes>
              <data:ClaimCode>
                <data:Code>F3</data:Code>
              </data:ClaimCode>
            </data:ClaimCodes>
            <data:CreditReportItem>TR01_1927605729_320525292_82</data:CreditReportItem>
            <data:LineItemComment>Account Tradeline</data:LineItemComment>
            <data:LineItemCommentType xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:UploadDocumentId xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
          </data:LineItem>
        </data:LineItems>
        <data:ServiceBundleFulfillmentKey>8426ca08-b076-4bfc-89f2-bf3f855e1619</data:ServiceBundleFulfillmentKey>
        <data:ServiceProductFulfillmentKey></data:ServiceProductFulfillmentKey>
      </con:request>
    </con:StartDispute>
  </soapenv:Body>
</soapenv:Envelope>